import {Injectable} from '@angular/core';
import {Observable,pipe} from "rxjs";
import {map} from "rxjs/operators"; 

import {AngularFirestore} from "@angular/fire/firestore";

import {sha256} from "js-sha256/src/sha256.js";

@Injectable({
  providedIn: 'root'
})
export class ShiftService {

  constructor(
    private firestore: AngularFirestore
  ){}
  
  /* variables */
  
  
  
  /* requests */
  
  importData(){
    let collect = this.firestore.collection("MonthlyData").doc("201909").collection("shift");
    
    let bigstrings = "2019-09-01,週日,孔廟園區,早上,劉曜瑄,劉青芳,周政霖,|2019-09-01,週日,孔廟園區,中午,陳東君,張惠真,張智惠,郭朝彬|2019-09-01,週日,孔廟園區,下午,林建成,楊孟樺,黃曉蘋,陳美瑩|2019-09-01,週日,安平西門國小,早上,胡家銘,黃心儀,李淑慧,黃時|2019-09-01,週日,安平西門國小,中午,蘇克尹,,高雨婷,吳怜瑩|2019-09-01,週日,安平西門國小,下午,,蔡玉民,吳素碧,羅林美英|2019-09-01,週日,安平樹屋停車場,中午,張佑維,陳珮瑜,王雪玲,康珍妮|2019-09-01,週日,安平樹屋停車場,下午,李信寬,黃麗君,柯麗郁,謝玫秀|2019-09-02,週一,成大醫院,早上,任宥澤,許麗玉,李蕎羚,黃薰萱|2019-09-02,週一,成大醫院,中午,黃文清,林麗芳,黃淑華,劉益君|2019-09-02,週一,成大醫院,下午,蔡元泓,陳亭妤,陳淑珍(東區東區),謝亞美|2019-09-03,週二,成大醫院,早上,王揖翔,謝秀鸞,許麗玉,黃佩儀|2019-09-03,週二,成大醫院,中午,蔡元勳,邱雅萍,張惠美(安南區安南),謝亞美|2019-09-03,週二,成大醫院,下午,蔡登山,蔡喬双,張智惠,蔡儀雯|2019-09-04,週三,成大醫院,早上,許獻升,許小慧,林麗芳,黃心儀|2019-09-04,週三,成大醫院,中午,田頭隼人,田頭思潔,張惠美(安南區安南),柯麗郁|2019-09-04,週三,成大醫院,下午,黃佩儀,林懷睦,陳淑珍(東區東區),劉淑惠|2019-09-05,週四,成大醫院,早上,任宥澤,任亦彤,康珍妮,陳秀玲(東區東區)|2019-09-05,週四,成大醫院,中午,李達飛,吳美醇,張惠真,謝亞美|2019-09-05,週四,成大醫院,下午,蔡登山,蔡麗珍,林乃玉,陳秀玲(安平區北部)|2019-09-06,週五,成大醫院,早上,蔡元泓,王秀珍,康珍妮,吳麗華|2019-09-06,週五,成大醫院,中午,李達飛,黃淑華,林麗芳,胡家銘|2019-09-06,週五,成大醫院,下午,蔡元勳,蔡儀雯,林懷睦,陳淑珍(東區東區)|2019-09-06,週五,後火車站,下午,呂育勝,林延清,蔡麗珍,陳亭妤|2019-09-07,週六,孔廟園區,早上,林建成,張文月,高久婷,林惠萍|2019-09-07,週六,孔廟園區,中午,劉曜瑄,黃信男,黃麗君,洪欣漪|2019-09-07,週六,孔廟園區,下午,王揖翔,譚金桂,陳淑珍(東區東區),張惠美(安南區安南)|2019-09-07,週六,安平西門國小,早上,鄭炳文,鄭瑋珠,陳秀玲(安平區北部),汪瑞琴|2019-09-07,週六,安平西門國小,中午,蔡元泓,蔡馨儀,柯麗郁,陳美華|2019-09-07,週六,安平西門國小,下午,任宥澤,任亦彤,賴恩惠,張惠真|2019-09-07,週六,安平樹屋停車場,中午,周政霖,黃梅花,謝亞美,劉美英|2019-09-07,週六,安平樹屋停車場,下午,李淑慧,高雨婷,黃心儀,康珍妮|2019-09-08,週日,孔廟園區,早上,,黃心儀,李淑慧,黃時|2019-09-08,週日,孔廟園區,中午,蘇克尹,陳佩均,柯麗郁,楊季羚|2019-09-08,週日,孔廟園區,下午,吳欣儒,劉麗琴,康珍妮,|2019-09-08,週日,安平西門國小,早上,劉曜瑄,劉美英,謝亞美,|2019-09-08,週日,安平西門國小,中午,陳東君,賴恩惠,張佑維,陳美瑩|2019-09-08,週日,安平西門國小,下午,林建成,謝玫秀,高雨婷,|2019-09-08,週日,安平樹屋停車場,中午,郭朝彬,張惠美(安南區安南),張智惠,|2019-09-08,週日,安平樹屋停車場,下午,楊孟樺,劉淑惠,羅林美英,吳怜瑩|2019-09-09,週一,成大醫院,早上,姬正宇,張智惠,洪欣漪,李蕎羚|2019-09-09,週一,成大醫院,中午,黃文清,任亦彤,李淑慧,林麗芳|2019-09-09,週一,成大醫院,下午,黃佩儀,林乃玉,陳亭妤,吳素碧|2019-09-10,週二,成大醫院,早上,鄭炳文,鄭瑋珠,王秀珍,林玉婷|2019-09-10,週二,成大醫院,中午,李達飛,康珍妮,楊季羚,林麗芳|2019-09-10,週二,成大醫院,下午,佐野尚文,佐野芙由,郭朝彬,李淑慧|2019-09-11,週三,成大醫院,早上,林麗芳,胡瓊瑢,黃佩儀,王淑燕|2019-09-11,週三,成大醫院,中午,黃梅花,劉美英,林鳳珠,張惠真|2019-09-11,週三,成大醫院,下午,許獻升,許小慧,李淑慧,陳淑珍(東區東區)|2019-09-12,週四,成大醫院,早上,林懷睦,黃薰萱,黃琇琪,王雅苓|2019-09-12,週四,成大醫院,中午,黃文清,蔡馨儀,黃麗君,張惠真|2019-09-12,週四,成大醫院,下午,郭朝彬,蔡喬双,黃麗雲,柯麗郁|2019-09-13,週五,孔廟園區,早上,蔡元泓,王秀珍,胡瓊瑢,黃梅花|2019-09-13,週五,孔廟園區,中午,李達飛,邱雅萍,吳素碧,高雨婷|2019-09-13,週五,孔廟園區,下午,蔡元勳,蔡儀雯,劉淑惠,陳淑珍(東區東區)|2019-09-13,週五,安平西門國小,早上,佐野尚文,佐野芙由,李蕎羚,洪姿蓉|2019-09-13,週五,安平西門國小,中午,楊琪成,林懷睦,洪姿蓉,楊淑芳|2019-09-13,週五,安平西門國小,下午,楊紀遜,楊孟樺,林延清,黃念貞|2019-09-13,週五,安平樹屋停車場,中午,洪紹銘,林麗芳,高久婷,|2019-09-13,週五,安平樹屋停車場,下午,林建成,蔡麗珍,李淑慧,|2019-09-14,週六,孔廟園區,早上,李信寬,吳怜瑩,魏彩晨,謝秀鸞|2019-09-14,週六,孔廟園區,中午,郭朝彬,周政霖,謝亞美,蔡馨儀|2019-09-14,週六,孔廟園區,下午,蘇克尹,張惠真,李淑慧,賴恩惠|2019-09-14,週六,安平西門國小,早上,陳東君,林延清,陳美瑩,陳錦蘭|2019-09-14,週六,安平西門國小,中午,黃信男,黃梅花,林鳳珠,黃麗君|2019-09-14,週六,安平西門國小,下午,王揖翔,高雨婷,黃心儀,王雅苓|2019-09-14,週六,安平樹屋停車場,中午,田頭隼人,田頭思潔,楊季羚,劉青芳|2019-09-14,週六,安平樹屋停車場,下午,王雪玲,張惠美(安南區安南),陳淑珍(東區東區),|2019-09-15,週日,孔廟園區,早上,黃信男,李婉雪,黃時,吳怜瑩|2019-09-15,週日,孔廟園區,中午,陳東君,陳珮瑜,楊季羚,陳美瑩|2019-09-15,週日,孔廟園區,下午,陳文志,林乃玉,吳素碧,謝玫秀|2019-09-15,週日,安平西門國小,早上,王揖翔,吳欣儒,李淑慧,|2019-09-15,週日,安平西門國小,中午,張佑維,周政霖,王雪玲,張智惠|2019-09-15,週日,安平西門國小,下午,呂育勝,黃薰萱,張惠真,呂嘉蓉|2019-09-15,週日,安平樹屋停車場,中午,,黃梅花,郭朝彬,謝亞美|2019-09-15,週日,安平樹屋停車場,下午,李信寬,高雨婷,黃曉蘋,羅林美英|2019-09-16,週一,成大醫院,早上,王揖翔,黃時,劉淑惠,黃薰萱|2019-09-16,週一,成大醫院,中午,李達飛,黃文清,任亦彤,黃淑華|2019-09-16,週一,成大醫院,下午,蔡元泓,林懷睦,黃佩儀,吳美醇|2019-09-17,週二,成大醫院,早上,蔡元勳,張惠美(永康區東部),李蕎羚,劉青芳|2019-09-17,週二,成大醫院,中午,劉淑惠,楊季羚,盧培吾,蘇玲玲|2019-09-17,週二,成大醫院,下午,任宥澤,任亦彤,蔡儀雯,王雅苓|2019-09-18,週三,成大醫院,早上,林麗芳,許小慧,黃心儀,胡瓊瑢|2019-09-18,週三,成大醫院,中午,楊琪成,楊淑芳,柯麗郁,盧培吾|2019-09-18,週三,成大醫院,下午,李淑慧,黃佩儀,林懷睦,許小慧|2019-09-19,週四,成大醫院,早上,李志明,李玉如,李蕎羚,吳怜瑩|2019-09-19,週四,成大醫院,中午,任宥澤,蘇克尹,林麗芳,吳美醇|2019-09-19,週四,成大醫院,下午,郭朝彬,洪欣漪,林乃玉,葉羿秋|2019-09-20,週五,成大醫院,早上,蔡元泓,施佳伶,李蕎羚,林玉婷|2019-09-20,週五,成大醫院,中午,李達飛,黃淑華,林麗芳,邱雅萍|2019-09-20,週五,成大醫院,下午,蔡元勳,蔡儀雯,黃念貞,李淑慧|2019-09-20,週五,後火車站,下午,蔡元泓,吳素碧,蔡麗珍,陳亭妤|2019-09-23,週一,成大醫院,早上,任宥澤,許麗玉,張智惠,洪欣漪|2019-09-23,週一,成大醫院,中午,李達飛,李淑慧,林麗芳,吳美醇|2019-09-23,週一,成大醫院,下午,林懷睦,林乃玉,吳素碧,陳亭妤|2019-09-24,週二,成大醫院,早上,鄭炳文,鄭瑋珠,黃佩儀,許麗玉|2019-09-24,週二,成大醫院,中午,蔡元勳,蘇玲玲,高久婷,葉美月|2019-09-24,週二,成大醫院,下午,王揖翔,陳秀玲(東區東區),蔡麗珍,黃薰萱|2019-09-25,週三,成大醫院,早上,許獻升,許小慧,胡瓊瑢,王淑燕|2019-09-25,週三,成大醫院,中午,張惠真,李俊,黃淑華,林鳳珠|2019-09-25,週三,成大醫院,下午,田頭隼人,田頭思潔,李淑慧,劉淑惠|2019-09-26,週四,成大醫院,早上,胡家銘,黃心儀,邱雅萍,施佳伶|2019-09-26,週四,成大醫院,中午,蘇克尹,黃麗君,林麗芳,劉益君|2019-09-26,週四,成大醫院,下午,郭朝彬,洪欣漪,黃佩儀,黃麗雲|2019-09-27,週五,成大醫院,早上,劉明仁,黃梅花,劉青芳,吳怜瑩|2019-09-27,週五,成大醫院,中午,胡家鉻,高久婷,後藤亞裕美,黃淑華|2019-09-27,週五,成大醫院,下午,楊紀遜,楊孟樺,吳素碧,陳亭妤|2019-09-27,週五,後火車站,下午,呂育勝,林懷睦,劉麗華,李淑慧|2019-09-28,週六,孔廟園區,早上,陳東君,陳美瑩,陳秀玲(安平區北部),陳錦蘭|2019-09-28,週六,孔廟園區,中午,黃信男,蔡元泓,蔡馨儀,林鳳珠|2019-09-28,週六,孔廟園區,下午,林建成,王雪玲,黃心儀,薛郁萱|2019-09-28,週六,安平西門國小,早上,李信寬,林延清,吳欣儒,吳怜瑩|2019-09-28,週六,安平西門國小,中午,田頭隼人,田頭思潔,洪欣漪,郭朝彬|2019-09-28,週六,安平西門國小,下午,蘇克尹,康珍妮,陳淑珍(東區東區),|2019-09-28,週六,安平樹屋停車場,中午,安大山,劉曜瑄,安貝麗,楊季羚|2019-09-28,週六,安平樹屋停車場,下午,譚金桂,李淑慧,高雨婷,|2019-09-29,週日,孔廟園區,早上,李信寬,李淑慧,黃心儀,胡家銘|2019-09-29,週日,孔廟園區,中午,蘇克尹,張惠美(安南區安南),楊季羚,王雪玲|2019-09-29,週日,孔廟園區,下午,呂育勝,羅林美英,黃麗君,呂嘉蓉|2019-09-29,週日,安平西門國小,早上,黃信男,李婉雪,劉曜瑄,黃時|2019-09-29,週日,安平西門國小,中午,陳東君,陳佩均,柯麗郁,陳美瑩|2019-09-29,週日,安平西門國小,下午,陳文志,劉麗琴,賴恩惠,康珍妮|2019-09-29,週日,安平樹屋停車場,中午,安大山,安貝麗,張智惠,張佑維|2019-09-29,週日,安平樹屋停車場,下午,譚金桂,黃薰萱,黃曉蘋,吳素碧|2019-09-30,週一,成大醫院,早上,王揖翔,許麗玉,黃薰萱,林鳳珠|2019-09-30,週一,成大醫院,中午,李達飛,李淑慧,劉益君,吳素碧|2019-09-30,週一,成大醫院,下午,蔡元泓,黃佩儀,陳淑珍(東區東區),吳美醇";

    let midstrings = bigstrings.split("|");
    let smallstrings = [];
    let data = [];
    
    let length = midstrings.length;
    for(let i=0;i<length;i++){
      smallstrings[i] = midstrings[i].split(",");
      data[i] = {
        date:smallstrings[i][0],
        day:smallstrings[i][1],
        site:smallstrings[i][2],
        shift_title:smallstrings[i][3],
        leader:smallstrings[i][4],
        members:[smallstrings[i][5],smallstrings[i][6],smallstrings[i][7]]
      };
    }
    for(let i=0;i<length;i++){
      collect.doc(sha256(data[i].date + data[i].site + data[i].shift_title)).set(data[i]);
    }
  }
  
}
